src/src/InformationRegisters/ProductsCodesPeripheralOffline.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ProductsCodesPeripheralOffline</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MeasurementUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UOM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Used</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ExchangeRule</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExchangeWithOfflinePeripheralsRules</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Code</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/Catalogs/Products.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Products</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AccountingMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryValuationMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessLine</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LinesOfBusiness</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Cell</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cells</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CountryOfOrigin</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpensesGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuaranteePeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HSCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HSCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InventoryGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MeasurementUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrderCompletionDeadline</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureFile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsCategory</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCategories</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProductsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplenishmentDeadline</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplenishmentMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryReplenishmentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Specification</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BillsOfMaterials</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TimeNorm</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseBatches</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseCharacteristics</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseSerialNumbers</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Warehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WriteOutTheGuaranteeCard</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsFreightService</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/InformationRegisters/ProductsCodesPeripheralOffline/Forms/RecordForm/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	Query = New Query(
	"SELECT TOP 1
	|	ProductsCodesPeripheralOffline.Code AS Code
	|FROM
	|	InformationRegister.ProductsCodesPeripheralOffline AS ProductsCodesPeripheralOffline
	|WHERE
	|	ProductsCodesPeripheralOffline.Code = &Code
	|	AND ProductsCodesPeripheralOffline.ExchangeRule = &ExchangeRule
	|	AND ProductsCodesPeripheralOffline.Products = VALUE(Catalog.Products.EmptyRef)
	|");
	
	Query.SetParameter("Code", CurrentObject.Code);
	Query.SetParameter("ExchangeRule", CurrentObject.ExchangeRule);
	
	If Not Query.Execute().IsEmpty() Then
		ToRemoveWrite = InformationRegisters.ProductsCodesPeripheralOffline.CreateRecordManager();
		ToRemoveWrite.Code = CurrentObject.Code;
		ToRemoveWrite.ExchangeRule = CurrentObject.ExchangeRule;
		ToRemoveWrite.Delete();
	EndIf;
	
	Code = PeripheralsOfflineServerCall.GetMaximumCode(Record.ExchangeRule)+1;
	While Code < CurrentObject.Code Do
		PeripheralsOfflineServerCall.DeleteCode(CurrentObject.ExchangeRule, Code);
		Code = Code+1;
	EndDo;
	
EndProcedure

&AtServer
Procedure OnWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	If Record.SourceRecordKey.Code <> CurrentObject.Code Then
		PeripheralsOfflineServerCall.DeleteCode(CurrentObject.ExchangeRule, Record.SourceRecordKey.Code);
	EndIf;
	
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer(Cancel, CheckedAttributes)
	
	Query = New Query(
	"SELECT TOP 1
	|	ProductsCodesPeripheralOffline.Code AS Code,
	|	ProductsCodesPeripheralOffline.Products AS Products,
	|	ProductsCodesPeripheralOffline.Characteristic AS Characteristic,
	|	ProductsCodesPeripheralOffline.Batch AS Batch,
	|	ProductsCodesPeripheralOffline.MeasurementUnit AS MeasurementUnit,
	|	ProductsCodesPeripheralOffline.Products.Description AS ProductsPresentation,
	|	ProductsCodesPeripheralOffline.Characteristic.Description AS CharacteristicPresentation,
	|	ProductsCodesPeripheralOffline.Batch.Description AS BatchPresentation,
	|	ProductsCodesPeripheralOffline.MeasurementUnit.Description AS MeasurementUnitPresentation
	|FROM
	|	InformationRegister.ProductsCodesPeripheralOffline AS ProductsCodesPeripheralOffline
	|WHERE
	|	ProductsCodesPeripheralOffline.Code = &Code
	|	AND ProductsCodesPeripheralOffline.Products <> VALUE(Catalog.Products.EmptyRef)");
	
	Query.SetParameter("Code", Record.Code);
	
	Selection = Query.Execute().Select();
	
	If Selection.Next() // Barcode is already written in the database
		AND Record.SourceRecordKey.Code <> Record.Code Then
		
		ErrorDescription = StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'This barcode is already specified for products %1'"),
				Selection.ProductsPresentation)
			+ ?(ValueIsFilled(Selection.Characteristic), " " + StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'Characteristic: %1'"), 
				Selection.CharacteristicPresentation),
				"")
			+ ?(ValueIsFilled(Selection.Batch), " " + StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'Batch: %1'"),
				Selection.BatchPresentation), 
				"");

		CommonUseClientServer.MessageToUser(ErrorDescription,, "Record.Code",, Cancel);
		
	EndIf;
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	CodesArray = GetFreeCodes().UnloadColumn("Code");
	Items.Code.ChoiceList.LoadValues(CodesArray);
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Function GetFreeCodes()
	
	FreeCodes = PeripheralsOfflineServerCall.GetFreeCodes(Record.ExchangeRule, 20);
	NewRow = FreeCodes.Add();
	NewRow.Code = PeripheralsOfflineServerCall.GetMaximumCode(Record.ExchangeRule)+1;
	
	Return FreeCodes;
	
EndFunction

#EndRegion
